tutorials/incompressible/icoDyMFoam/turboPassageRotating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       0.01;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }

    U
    {
        solver          BiCGStab;
        preconditioner      DILU;

        minIter         0;
        maxIter         1000;
        tolerance       1e-07;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
